---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleType
source: html/d767803c-8595-c6d8-6177-cd4a732c9e18.htm
---
# Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleType Method

Returns the RebarHandleType of a RebarConstrainedHandle.

## Syntax (C#)
```csharp
public RebarHandleType GetHandleType()
```

## Returns
The RebarHandleType of the specified RebarConstrainedHandle.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - RebarConstrainedHandle is no longer valid.